## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      RESOURCE                                      |
|--------|------------------------------------------------------------------------------------|
| add    | `aws_iam_policy.superset_athena_read[&quot;operations_aws_production&quot;]`                 |
|        | `aws_iam_role.superset_athena_read[&quot;operations_aws_production&quot;]`                   |
|        | `aws_iam_role_policy_attachment.superset_athena_read[&quot;operations_aws_production&quot;]` |
| update | `module.celery_beat_ecs.aws_ecs_service.this`                                      |
|        | `module.celery_worker_ecs.aws_ecs_service.this`                                    |
|        | `module.superset_ecs.aws_ecs_service.this`                                         |
| delete | `aws_iam_policy.superset_athena_read`                                              |
|        | `aws_iam_role.superset_athena_read`                                                |
|        | `aws_iam_role_policy_attachment.superset_athena_read`                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.superset_athena_read will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_policy" "superset_athena_read" {
      - arn              = "arn:aws:iam::066023111852:policy/SupersetAthenaRead" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::066023111852:policy/SupersetAthenaRead" -> null
      - name             = "SupersetAthenaRead" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "athena:GetDataCatalog"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      - Sid      = "AthenaDataCatalogAccess"
                    },
                  - {
                      - Action   = [
                          - "athena:StopQueryExecution",
                          - "athena:StartQueryExecution",
                          - "athena:ListWorkGroups",
                          - "athena:ListTagsForResource",
                          - "athena:ListTableMetadata",
                          - "athena:ListQueryExecutions",
                          - "athena:ListNamedQueries",
                          - "athena:ListDatabases",
                          - "athena:ListDataCatalogs",
                          - "athena:GetWorkGroup",
                          - "athena:GetTableMetadata",
                          - "athena:GetQueryResultsStream",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                          - "athena:GetPreparedStatement",
                          - "athena:GetNamedQuery",
                          - "athena:DeletePreparedStatement",
                          - "athena:CreatePreparedStatement",
                          - "athena:BatchGetQueryExecution",
                          - "athena:BatchGetNamedQuery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AthenaRead"
                    },
                  - {
                      - Action   = [
                          - "glue:GetTables",
                          - "glue:GetTableVersions",
                          - "glue:GetTableVersion",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                          - "glue:GetPartition",
                          - "glue:GetDatabases",
                          - "glue:GetDatabase",
                          - "glue:BatchGetPartition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:glue:ca-central-1:739275439843:table/operations_aws_production/*",
                          - "arn:aws:glue:ca-central-1:739275439843:database/operations_aws_production",
                          - "arn:aws:glue:ca-central-1:739275439843:catalog",
                          - "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      - Sid      = "GlueRead"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          - "arn:aws:s3:::cds-data-lake-transformed-production",
                          - "arn:aws:s3:::cds-data-lake-curated-production/*",
                          - "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      - Sid      = "S3AthenaSourceBucketRead"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-athena-production/*",
                          - "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      - Sid      = "S3AthenaResultBucketWrite"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQ6X2IXSWB6VQWYLDI" -> null
      - tags             = {
          - "Terraform" = "true"
        } -> null
      - tags_all         = {
          - "Terraform" = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.superset_athena_read["operations_aws_production"] will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead-operations_aws_production"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "athena:GetDataCatalog"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      + Sid      = "AthenaDataCatalogAccess"
                    },
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetTableMetadata",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-athena-production/*",
                          + "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/operations_aws_production/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/operations_aws_production",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                          + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      + Sid      = "GlueRead-operations_aws_production"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.superset_athena_read will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role" "superset_athena_read" {
      - arn                   = "arn:aws:iam::066023111852:role/SupersetAthenaRead" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-01-30T12:57:53Z" -> null
      - description           = "This role allows the Superset ECS task to read from Athena as a datasource" -> null
      - force_detach_policies = false -> null
      - id                    = "SupersetAthenaRead" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::066023111852:policy/SupersetAthenaRead",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SupersetAthenaRead" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Terraform" = "true"
        } -> null
      - tags_all              = {
          - "Terraform" = "true"
        } -> null
      - unique_id             = "AROAQ6X2IXSWG77NHD6HI" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.superset_athena_read["operations_aws_production"] will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task to read from Athena's Glue catalog operations_aws_production database"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead-operations_aws_production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.superset_athena_read will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      - id         = "SupersetAthenaRead-20240130125753722700000001" -> null
      - policy_arn = "arn:aws:iam::066023111852:policy/SupersetAthenaRead" -> null
      - role       = "SupersetAthenaRead" -> null
    }

  # aws_iam_role_policy_attachment.superset_athena_read["operations_aws_production"] will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead-operations_aws_production"
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:85" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:75"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:88" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:77"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:104" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:93"
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
